vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/Boards/Keil/MCB2140/USBAudio/demo.c
/*----------------------------------------------------------------------------
 * Name:    demo.c
 * Purpose: USB Audio Demo
 * Version: V1.20
 *----------------------------------------------------------------------------
 * This file is part of the uVision/ARM development tools.
 * This software may only be used under the terms of a valid, current,
 * end user licence from KEIL for a compatible version of KEIL software
 * development tools. Nothing else gives you the right to use this software.
 *
 * This software is supplied "AS IS" without warranties of any kind.
 *
 * Copyright (c) 2008 Keil - An ARM Company. All rights reserved.
 *----------------------------------------------------------------------------*/

#include <LPC214X.H>                        /* LPC214x definitions */

#include "type.h"

#include "usb.h"
#include "usbcfg.h"
#include "usbhw.h"

#include "demo.h"


U8  Mute;                                   /* Mute State */
U32 Volume;                                 /* Volume Level */

#if USB_DMA
#pragma arm section zidata = "USB_RAM"
U32 InfoBuf[P_C];                           /* Packet Info Buffer */
S16 DataBuf[B_S];                           /* Data Buffer */
#pragma arm section zidata
#else
S16 DataBuf[B_S];                           /* Data Buffer */
#endif

U16 DataOut;                                /* Data Out Index */
U16 DataIn;                                 /* Data In Index */

U8  DataRun;                                /* Data Stream Run State */

U16 PotVal;                                 /* Potenciometer Value */

U32 VUM;                                    /* VU Meter */

U32 Tick;                                   /* Time Tick */


/*
 * Get Potentiometer Value
 */

void get_potval (void) {
  U32 val;

  AD0CR |= 0x01000000;                      /* Start A/D Conversion */
  do {
    val  = AD0GDR;                          /* Read A/D Data Register */
  } while ((val & 0x80000000) == 0);        /* Wait for end of A/D Conversion */
  AD0CR &= ~0x01000000;                     /* Stop A/D Conversion */
  PotVal = ((val >> 8) & 0xF8) +            /* Extract Potenciometer Value */
           ((val >> 7) & 0x08);
}


/*
 * Timer Counter 0 Interrupt Service Routine
 *   executed each 31.25us (32kHz frequency)
 */

void tc1_isr (void) __irq {
  long  val;
  U32 cnt;

  if (DataRun) {                            /* Data Stream is running */
    val = DataBuf[DataOut];                 /* Get Audio Sample */
    cnt = (DataIn - DataOut) & (B_S - 1);   /* Buffer Data Count */
    if (cnt == (B_S - P_C*P_S)) {           /* Too much Data in Buffer */
      DataOut++;                            /* Skip one Sample */
    }
    if (cnt > (P_C*P_S)) {                  /* Still enough Data in Buffer */
      DataOut++;                            /* Update Data Out Index */
    }
    DataOut &= B_S - 1;                     /* Adjust Buffer Out Index */
    if (val < 0) VUM -= val;                /* Accumulate Neg Value */
    else         VUM += val;                /* Accumulate Pos Value */
    val  *= Volume;                         /* Apply Volume Level */
    val >>= 16;                             /* Adjust Value */
    val  += 0x8000;                         /* Add Bias */
    val  &= 0xFFFF;                         /* Mask Value */
  } else {
    val = 0x8000;                           /* DAC Middle Point */
  }

  if (Mute) {
    val = 0x8000;                           /* DAC Middle Point */
  }

  DACR = val & 0xFFC0;                      /* Set Speaker Output */

  if ((Tick++ & 0x03FF) == 0) {             /* On every 1024th Tick */
    get_potval();                           /* Get Potenciometer Value */
    if (VolCur == 0x8000) {                 /* Check for Minimum Level */
      Volume = 0;                           /* No Sound */
    } else {
      Volume = VolCur * PotVal;             /* Chained Volume Level */
    }
    val = VUM >> 20;                        /* Scale Accumulated Value */
    VUM = 0;                                /* Clear VUM */
    if (val > 7) val = 7;                   /* Limit Value */
    IOCLR1 = LED_MSK;                       /* Turn Off all LEDs */
    IOSET1 = LED_MSK >> (7 - val);          /* LEDs show VU Meter */
  }

  T1IR = 1;                                 /* Clear Interrupt Flag */
  VICVectAddr = 0;                          /* Acknowledge Interrupt */
}


/* Main Program */

int main (void) {

  PINSEL1 = 0x01080000;                     /* Select AOUT,AIN1 */
  IODIR1 |= LED_MSK;                        /* LED's defined as Outputs */

  AD0CR   = 0x00200E02;                     /* ADC: 10-bit AIN1 @ 4MHz */
  DACR    = 0x00008000;                     /* DAC Output set to Middle Point */

  /* Setup Timer Counter 1: Periodic Timer with Interrupt at DATA_FREQ Rate */
  T1MR0 = VPB_CLOCK/DATA_FREQ - 1;          /* TC1 Match Value 0 */
  T1MCR = 3;                                /* TC1 Interrupt and Reset on MR0 */
  T1TCR = 1;                                /* TC1 Enable */

  /* Setup Timer Counter 1 Interrupt */
  VICVectAddr1 = (unsigned long)tc1_isr;    /* TC1 Interrupt -> Vector 1 */
  VICVectCntl1 = 0x20 | 5;                  /* TC1 Interrupt -> IRQ Slot 1 */
  VICIntEnable = 1 << 5;                    /* Enable TC1 Interrupt */

  USB_Init();                               /* USB Initialization */
  USB_Connect(__TRUE);                      /* USB Connect */

  while (1);                                /* Loop forever */
}
